#include"lazy.h"

int main()
{
    LICENSE;
    /*
程序设计作业武成岗 今天 星期五 14:06

（一）复习课堂讲解内容，在机器上运行例题【提交源程序】
课堂上的例题已经全部重写.

（二）请写出下列整型数据的32 位补码的八进制、十六进制形式。

-1、1024、4286、-123

-1=-01=-0x01、1024=02000=0x400、4286=010276=0x10BE、-123=-0173=-0x7B

计算方法:
对于负数-x:
十进制:4294967296-x
八进制:040000000000-x
十六进制:0x100000000-x

-1=037777777777=0xFFFFFFFF、1024=02000=0x400、4286=010276=0x10BE、-123=37777777605=0xFFFFFF85

（三）计算下列表达式的结果，用十进制表示
1、0X87-076
2、832-0101

1、0X87-076=73
2、832-0101=767

过程略
*/
    CK(5 / 2);
    CK(5 % 2);
    CK(-5 / 2);
    CK(-5 % 2);
}